MusicApp/app/controllers/albums_controller.rb

  def create
    debugger
    @band = Band.find(params[:band_id])
    @album = Album.new(album_params)
    @album.band = @band
    if @album.save
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "albums" ("title", "year", "live_or_studio", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "White album"], ["year", "2015"], ["live_or_studio", "t"], ["band_id", 1], ["created_at", "2017-11-30 22:06:02.586017"], ["updated_at", "2017-11-30 22:06:02.586017"]]