MusicApp/app/controllers/bands_controller.rb

  def show
    @band = Band.find(params[:id])
    @album = Album.find(params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]