MusicApp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "scott123"], ["session_token", "08dZxml6yc_h9A_wSh8eVA"], ["created_at", "2017-11-30 17:11:56.577469"], ["updated_at", "2017-11-30 17:11:56.577469"]]
---
  def create
    @user = User.new(user_params)

    if @user.save